Билет04/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.НачисленияСотрудникам</xr:Item>
				<xr:Item>CalculationRegister.ДопНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Графики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Comment>!! только для возможноти создавать новые виды расчета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Comment>% премии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет04/CalculationRegisters/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Comment>!! только для возможноти создавать новые виды расчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет04/InformationRegisters/ТарифныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет04/CalculationRegisters/ДопНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДопНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет04/Enums/АлгоритмыРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>АлгоритмыРасчетаНачислений</Name>
			<Comment>!! только для возможноти создавать новые виды расчета</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОтработанномуВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтБазы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаОтработанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднему</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Билет04/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр НачисленияСотрудникам
	Движения.НачисленияСотрудникам.Очистить();
	Движения.НачисленияСотрудникам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыОсновныеНачисления.Подразделение КАК Подразделение,
		|	НачислениеЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	НачислениеЗарплатыОсновныеНачисления.График КАК График,
		|	НачислениеЗарплатыОсновныеНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	НачислениеЗарплатыОсновныеНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	НачислениеЗарплатыОсновныеНачисления.Параметр КАК Параметр
		|ПОМЕСТИТЬ вт_ОснНачисления
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И НачислениеЗарплатыОсновныеНачисления.ВидРасчета.АлгоритмРасчета В(&АлгоритмыРасчетаОтработанногоВремени)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ОснНачисления.Сотрудник КАК Сотрудник,
		|	вт_ОснНачисления.Подразделение КАК Подразделение,
		|	вт_ОснНачисления.ВидРасчета КАК ВидРасчета,
		|	вт_ОснНачисления.График КАК График,
		|	вт_ОснНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	вт_ОснНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	МАКСИМУМ(ТарифныеСтавки.Период) КАК Период
		|ПОМЕСТИТЬ вт_ДатыСрезаПоТарифу
		|ИЗ
		|	вт_ОснНачисления КАК вт_ОснНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки КАК ТарифныеСтавки
		|		ПО вт_ОснНачисления.График = ТарифныеСтавки.Смена
		|			И вт_ОснНачисления.ПериодДействияНачало > ТарифныеСтавки.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ОснНачисления.Подразделение,
		|	вт_ОснНачисления.График,
		|	вт_ОснНачисления.ПериодДействияКонец,
		|	вт_ОснНачисления.ВидРасчета,
		|	вт_ОснНачисления.Сотрудник,
		|	вт_ОснНачисления.ПериодДействияНачало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ОснНачисления.Сотрудник КАК Сотрудник,
		|	вт_ОснНачисления.Подразделение КАК Подразделение,
		|	вт_ОснНачисления.ВидРасчета КАК ВидРасчета,
		|	вт_ОснНачисления.График КАК График,
		|	вт_ОснНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	вт_ОснНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ТарифныеСтавки.Тариф КАК Тариф,
		|	ТарифныеСтавки.Период КАК Период,
		|	вт_ОснНачисления.Параметр КАК Параметр
		|ИЗ
		|	вт_ОснНачисления КАК вт_ОснНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки КАК ТарифныеСтавки
		|		ПО вт_ОснНачисления.График = ТарифныеСтавки.Смена
		|			И вт_ОснНачисления.ПериодДействияНачало <= ТарифныеСтавки.Период
		|			И вт_ОснНачисления.ПериодДействияКонец >= ТарифныеСтавки.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_ДатыСрезаПоТарифу.Сотрудник,
		|	вт_ДатыСрезаПоТарифу.Подразделение,
		|	вт_ДатыСрезаПоТарифу.ВидРасчета,
		|	вт_ДатыСрезаПоТарифу.График,
		|	вт_ДатыСрезаПоТарифу.ПериодДействияНачало,
		|	вт_ДатыСрезаПоТарифу.ПериодДействияКонец,
		|	ТарифныеСтавки.Тариф,
		|	вт_ДатыСрезаПоТарифу.Период,
		|	NULL
		|ИЗ
		|	вт_ДатыСрезаПоТарифу КАК вт_ДатыСрезаПоТарифу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки КАК ТарифныеСтавки
		|		ПО вт_ДатыСрезаПоТарифу.График = ТарифныеСтавки.Смена
		|			И вт_ДатыСрезаПоТарифу.Период = ТарифныеСтавки.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|ИТОГИ
		|	МИНИМУМ(ПериодДействияНачало),
		|	МАКСИМУМ(ПериодДействияКонец)
		|ПО
		|	Сотрудник,
		|	Подразделение";
	
	АлгоритмыРасчетаОтработанногоВремени	= Новый Массив(1);
	АлгоритмыРасчетаОтработанногоВремени[0]	= Перечисления.АлгоритмыРасчетаНачислений.ЗаОтработанноеВремя;
//	АлгоритмыРасчетаОтработанногоВремени[1]	= Перечисления.АлгоритмыРасчетаНачислений.ПропорциональноОтработанномуВремени;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("АлгоритмыРасчетаОтработанногоВремени", АлгоритмыРасчетаОтработанногоВремени);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСотрудник.Следующий() Цикл
		ВыборкаПодразделение = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПодразделение.Следующий() Цикл
			ПредыдущаяДата	= ВыборкаПодразделение.ПериодДействияКонец;
			Выборка	= ВыборкаПодразделение.Выбрать();
			Пока Выборка.Следующий() Цикл
				Движение = Движения.НачисленияСотрудникам.Добавить();
				Движение.ПериодРегистрации = НачалоМесяца(Дата);
				Движение.Сотрудник = Выборка.Сотрудник;
				Движение.Подразделение = Выборка.Подразделение;
				Движение.График = Выборка.График;
				Движение.ВидРасчета = Выборка.ВидРасчета;
				Движение.ПериодДействияНачало = Макс(Выборка.Период, Выборка.ПериодДействияНачало);
				Движение.ПериодДействияКонец = Мин(ПредыдущаяДата, Выборка.ПериодДействияКонец);
				Движение.БазовыйПериодНачало	= НачалоМесяца(Дата);
				Движение.БазовыйПериодКонец		= КонецМесяца(Дата);
				Движение.Параметр	= Выборка.Тариф;
				
				ПредыдущаяДата	= Движение.ПериодДействияНачало - 24*60*60;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	//----- Алгоритмы расчета начислений не по отработанному времени ------
	Для каждого стр Из ОсновныеНачисления Цикл
		Если стр.ВидРасчета.АлгоритмРасчета <> Перечисления.АлгоритмыРасчетаНачислений.ЗаОтработанноеВремя	Тогда 
			Движение		= Движения.НачисленияСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, стр);
			Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Движение.ПериодДействияНачало = стр.ДатаНачала;
			Движение.ПериодДействияКонец = стр.ДатаОкончания;
			Движение.БазовыйПериодНачало	= НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец		= КонецМесяца(Дата);
		КонецЕсли; 	
	КонецЦикла; 
	
	//------------------------------------------------------
	
	// регистр ДопНачисления
	Движения.ДопНачисления.Очистить();
	Движения.ДопНачисления.Записывать = Истина;
	Для Каждого стр Из ДополнительныеНачисления Цикл
		Движение = Движения.ДопНачисления.Добавить();
		Движение.ВидРасчета = стр.ВидРасчета;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.Сотрудник = стр.Сотрудник;
		Движение.Подразделение = стр.Подразделение;
		Движение.Параметр = стр.Параметр;
		Движение.БазовыйПериодНачало	= НачалоМесяца(ДобавитьМесяц(Дата, -1));
		Движение.БазовыйПериодКонец		= КонецМесяца(ДобавитьМесяц(Дата, -1));
	КонецЦикла;
	
	Движения.Записать();
	
	Расчет.РассчитатьНачисления(ССылка);
	
КонецПроцедуры
